var quoteArea = document.getElementById("rQuote");

var quotes = [
    "إذا رأى أحدكم جنازة، فإن لم يكن ماشيا معها، فليقم حتى يخلفها أو تخلفه أو توضع من قبل أن تخلفه . <span> (عن عامر بن ربيعة، رواه البخاري)</span>",
    "بني الإسلام على خمس: شهادة أن لا إله إلا الله وأن محمدا رسول الله، وإقامَ الصلاة، وإيتاءَ الزكاة، والحج، وصوم رمضان <span> (عن ابن عمر، رواه البخاري)</span>",
    "لا يدخل الجنة من كان في قلبه مثقال ذرة من كِبَر <span> (عن عبد الله بن مسعود، رواه مسلم)</span>",
    "المسلم مَن سلم المسلمون من لسانه ويده، والمهاجر من هجر ما نهى الله عنه <span> (عن عبد الله بن عمر، رواه البخاري)</span>",
    "الساعي على الأرملة والمسكين، كالمجاهد في سبيل الله أو القائم الليل، الصائم النهار <span> (عن أبي هريرة، رواه الشيخان)</span>",
    "إذا أُمَّ أحدكم الناس، فليخفف، فإن فيهم الصغير والكبير والضعيف والمريض وذا الحاجة، وإذا صلى لنفسه فليطوّل ما شاء <span> (عن أبي هريرة، رواه الشيخان)</span>",
    " إذا تقاضى إليك رجلان، فلا تقض للأول حتى تسمع كلام الآخر، فسوف تدري كيف تقضي<span>(عن علِيّ رضي الله عنه، رواه أحمد وأبو داود والترمذي)</span>",
    "قال رَسُولُ اللهِ : “مَنْ قَالَ لاَ إِلهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ فِي كُلِّ يَوْمٍ، مَائَةَ مَرَّةٍ كَانَتْ لَهُ عَدْلَ عَشْرِ رِقَابٍ، وَكُتِبَتْ لَهُ مَائَةُ حَسَنَةٍ، وَمُحِيَتْ عَنْهُ مَائَةُ سَيِّئَةٍ، وَكَانَتْ لَهُ حِرْزًا مِنَ الشَّيْطَانِ، يَوْمَهُ ذلِكَ، حَتَّى يُمْسِي وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا جَاءَ بِهِ، إِلاَّ أَحَدٌ عَمِلَ أَكْثَرَ مِنْ ذَلِكَ” <span> (متفق عليه من حديث أَبِي هُرَيْرَةَ رضي الله عنه) </span>",
    "قال رسول الله صلى الله عليه وآله وصحبه وسلم: (يقول الله تعالى: أنا عند ظن عبدي بي، وأنا معه إذا ذكرني، فإن ذكرني في نفسه ذكرته في نفسي، وإن ذكرني في ملاء ذكرته في ملاء خير منهم، وإن تقرب إليّ بشبر تقربت إليه ذراعاً، وإن تقرب إليَّ ذراعاً تقربت إليه باعاً، وإن أتاني يمشي أتيته هرولة) <span> (رواه البخاري ومسلم) </span>",
    "قال رسول الله صّلى الله عليه وسلم: “المؤمن القوي خير وأحب إلي الله من المؤمن الضعيف ،وفي كل خير، احرص على ما ينفعك، واستعن بالله، ولا تعجزه، وإن أصابك شيء ،فلا تقل لو أني فعلت كذا كان كذا ،ولكن قل قدر الله وما شاء فعل، فإن لو تفتح عمل الشيطان” <span> (أخرجه مسلم) </span>",
];

var randomNum,lastNum;

function randomQuote() {
randomNum = Math.floor(Math.random() * quotes.length) ;
if (randomNum==lastNum){
randomQuote();
}

else{
quoteArea.innerHTML = `${quotes[randomNum]}`;
}

lastNum = randomNum;
}